In [1]:
import sqlalchemy

%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# 암시적 형 변환 이해하기
"숫자로 형 변환하는 함수"

In [20]:
%%sql

SELECT * FROM col WHERE tname='EMP'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('EMP', 1, 'EMPNO', 'NUMBER', 22, 0, 4, 'NOT NULL', None, None),
 ('EMP', 2, 'ENAME', 'VARCHAR2', 10, None, None, 'NULL', None, 'CHAR_CS'),
 ('EMP', 3, 'JOB', 'VARCHAR2', 9, None, None, 'NULL', None, 'CHAR_CS'),
 ('EMP', 4, 'MGR', 'NUMBER', 22, 0, 4, 'NULL', None, None),
 ('EMP', 5, 'HIREDATE', 'DATE', 7, None, None, 'NULL', None, None),
 ('EMP', 6, 'SAL', 'NUMBER', 22, 2, 7, 'NULL', None, None),
 ('EMP', 7, 'COMM', 'NUMBER', 22, 2, 7, 'NULL', None, None),
 ('EMP', 8, 'DEPTNO', 'NUMBER', 22, 0, 2, 'NULL', None, None)]

In [22]:
%%sql

select ename, sal
    from emp
    where sal = '3000'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('FORD', Decimal('3000')), ('SCOTT', Decimal('3000'))]

위의 Query문은 좋은 형태가 아니다  
- sal의 데이터 타입이 NUMBER로 되어 있는데 검색 조건을 VARCHAR로 조회하였기 때문

<br>

그럼에도 불구하고 자료가 조회된 이유
- 오라클에서 내부적으로 문자형을 숫자형으로 변환해주었기 때문
- 하지만 검색 속도가 느려지기 때문에 자료형을 맞추어 주는 것이 중요

문제 99. 1981년도에 입사한 사원들의 이름과 입사한 년도를 출력하는데
            가장 최근에 입사한 사원부터 출력하시오

In [32]:
%%sql

select ename "이름", to_char(hiredate, 'RRRR') "입사년도"
    from emp
    where hiredate between to_date('81/01/01', 'RR/MM/DD')
          and to_date('81/12/31', 'RR/MM/DD')
    order by hiredate desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JAMES', '1981'),
 ('FORD', '1981'),
 ('KING', '1981'),
 ('MARTIN', '1981'),
 ('TURNER', '1981'),
 ('CLARK', '1981'),
 ('BLAKE', '1981'),
 ('JONES', '1981'),
 ('WARD', '1981'),
 ('ALLEN', '1981')]

![image](https://user-images.githubusercontent.com/70187490/126032822-1c5c87ad-596d-415c-ad2c-365cc187bbc6.png)

where 절에 검색조건을 적을 때 주의할 사항
- 문자 컬럼의 데이터를 검색할 때는 문자로 검색하고
- 숫자 컬럼의 데이터를 검색할 때는 숫자로 검색해야 함

<br>

- 만약 문자형인데 숫자형으로 검색하거나 숫자형인데 문자형으로 검색하면 오라클은 에러가 발생하지는 않지만 검색 성능이 느려지게 됨
- 그러므로 반드시 검색 조건을 적을 때 위의사항을 지켜줘야 함

# NULL 값 대신 다른 데이터 출력하기(NVL, NVL2)
"null 값 대신에 다른 값을 출력하고 싶을 때 사용하는 함수"

이름, 월급, 월급 + 커미션을 출력하시오

In [36]:
%%sql

select ename, nvl(sal,0), nvl(sal,0) + nvl(comm,0)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JACK', 0, 0),
 ('KING', 5000, 5000),
 ('BLAKE', 2850, 2850),
 ('CLARK', 2450, 2450),
 ('JONES', 2975, 2975),
 ('MARTIN', 1250, 2650),
 ('ALLEN', 1600, 1900),
 ('TURNER', 1500, 1500),
 ('JAMES', 950, 950),
 ('WARD', 1250, 1750),
 ('FORD', 3000, 3000),
 ('SMITH', 800, 800),
 ('SCOTT', 3000, 3000),
 ('ADAMS', 1100, 1100),
 ('MILLER', 1300, 1300)]

문제 101. 이름, 커미션을 출력하는데 커미션이 null인 사원들은 no comm이라는 글씨가 출력되게 하시오

In [43]:
%%sql

select ename, nvl(to_char(comm),'no comm')"comm"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JACK', 'no comm'),
 ('KING', 'no comm'),
 ('BLAKE', 'no comm'),
 ('CLARK', 'no comm'),
 ('JONES', 'no comm'),
 ('MARTIN', '1400'),
 ('ALLEN', '300'),
 ('TURNER', '0'),
 ('JAMES', 'no comm'),
 ('WARD', '500'),
 ('FORD', 'no comm'),
 ('SMITH', 'no comm'),
 ('SCOTT', 'no comm'),
 ('ADAMS', 'no comm'),
 ('MILLER', 'no comm')]

select ename, nvl(comm, 'no comm')  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;from emp;  
<br>
comm &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-> 숫자형  
'no comm' -> 문자형  

<br>

- 숫자형을 문자형으로 변환해서 데이터 타입을 서로 동일하게 맞춰주고 출력하고 됨

문제102. 커미션이 null인 사원의 이름과 커미션을 출력하시오!
            (is null 연산자를 사용하지 말고 nvl함수로 수행하시오)

In [46]:
%%sql

select ename, comm
    from emp
    where nvl(comm, -1) = -1

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JACK', None),
 ('KING', None),
 ('BLAKE', None),
 ('CLARK', None),
 ('JONES', None),
 ('JAMES', None),
 ('FORD', None),
 ('SMITH', None),
 ('SCOTT', None),
 ('ADAMS', None),
 ('MILLER', None)]

# IF문을 SQL로 구현하기 1(DECODE)
" if문을 sql로 구현할 때 사용하는 함수 "

In [48]:
%%sql

select ename, sal, deptno,
    decode(deptno, 10, 5600,
                   20, 4500,
                   0) as 보너스
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JACK', None, None, 0),
 ('KING', Decimal('5000'), 10, 5600),
 ('BLAKE', Decimal('2850'), 30, 0),
 ('CLARK', Decimal('2450'), 10, 5600),
 ('JONES', Decimal('2975'), 20, 4500),
 ('MARTIN', Decimal('1250'), 30, 0),
 ('ALLEN', Decimal('1600'), 30, 0),
 ('TURNER', Decimal('1500'), 30, 0),
 ('JAMES', Decimal('950'), 30, 0),
 ('WARD', Decimal('1250'), 30, 0),
 ('FORD', Decimal('3000'), 20, 4500),
 ('SMITH', Decimal('800'), 20, 4500),
 ('SCOTT', Decimal('3000'), 20, 4500),
 ('ADAMS', Decimal('1100'), 20, 4500),
 ('MILLER', Decimal('1300'), 10, 5600)]

문제 103. 이름, 월급, 직업, 보너스를 출력하는데 보너스가 'SALESMAN'이면 4500을 출력하고 직업이 'ANALYST'면 2400을 출력하고 나머지 직업은 0을 출력해라

In [49]:
%%sql

select ename, sal, job, 
       decode(job, 'SALESMAN', 4500,
                   'ANALYST',  2400,
                    0) as 보너스
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JACK', None, None, 0),
 ('KING', Decimal('5000'), 'PRESIDENT', 0),
 ('BLAKE', Decimal('2850'), 'MANAGER', 0),
 ('CLARK', Decimal('2450'), 'MANAGER', 0),
 ('JONES', Decimal('2975'), 'MANAGER', 0),
 ('MARTIN', Decimal('1250'), 'SALESMAN', 4500),
 ('ALLEN', Decimal('1600'), 'SALESMAN', 4500),
 ('TURNER', Decimal('1500'), 'SALESMAN', 4500),
 ('JAMES', Decimal('950'), 'CLERK', 0),
 ('WARD', Decimal('1250'), 'SALESMAN', 4500),
 ('FORD', Decimal('3000'), 'ANALYST', 2400),
 ('SMITH', Decimal('800'), 'CLERK', 0),
 ('SCOTT', Decimal('3000'), 'ANALYST', 2400),
 ('ADAMS', Decimal('1100'), 'CLERK', 0),
 ('MILLER', Decimal('1300'), 'CLERK', 0)]

문제 104. 이름, 입사한 년도 4자리로 출력하시오!

In [51]:
%%sql

select ename, to_char(hiredate,'RRRR') as 입사년도
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JACK', '1982'),
 ('KING', '1981'),
 ('BLAKE', '1981'),
 ('CLARK', '1981'),
 ('JONES', '1981'),
 ('MARTIN', '1981'),
 ('ALLEN', '1981'),
 ('TURNER', '1981'),
 ('JAMES', '1981'),
 ('WARD', '1981'),
 ('FORD', '1981'),
 ('SMITH', '1980'),
 ('SCOTT', '1982'),
 ('ADAMS', '1983'),
 ('MILLER', '1982')]

문제 105. 이름, 입사한 년도, 보너스를 출력하는데 보너스가 입사한 년도가  
1980년이면 5000을 출력하고  
1981년이면 4000을 출력하고  
나머지 년도는 0으로 출력하시오

In [54]:
%%sql

select ename, to_char(hiredate,'RRRR') as 입사년도, 
    decode(to_char(hiredate,'RRRR'), 1980, 5000,
                                     1981, 4000,
                                     0 )   as 보너스
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JACK', '1982', 0),
 ('KING', '1981', 4000),
 ('BLAKE', '1981', 4000),
 ('CLARK', '1981', 4000),
 ('JONES', '1981', 4000),
 ('MARTIN', '1981', 4000),
 ('ALLEN', '1981', 4000),
 ('TURNER', '1981', 4000),
 ('JAMES', '1981', 4000),
 ('WARD', '1981', 4000),
 ('FORD', '1981', 4000),
 ('SMITH', '1980', 5000),
 ('SCOTT', '1982', 0),
 ('ADAMS', '1983', 0),
 ('MILLER', '1982', 0)]

# IF 문을 SQL로 구현하기 (CASE)
" decode는 등호(=) 비교 만 가능하기 때문에 만약 부등호 비교를 하려면 case문을 사용해야 한다. "  
case문은 등호 비교, 부등호 비교 둘 다 가능하다

문제 106. 이름과 월급, 보너스를 출력하는데 보너스가  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;월급이 4000 이상이면 500을 출력하고  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;월급이 2000 이상이면 300을 출력하고  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;나머지 월급 사원들은 0을 출력하시오

In [58]:
%%sql

select ename as 이름, sal as 월급, 
    case when sal >= 4000 then 500
         when sal >= 2000 then 300
         else 0 end as 보너스
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JACK', None, 0),
 ('KING', Decimal('5000'), 500),
 ('BLAKE', Decimal('2850'), 300),
 ('CLARK', Decimal('2450'), 300),
 ('JONES', Decimal('2975'), 300),
 ('MARTIN', Decimal('1250'), 0),
 ('ALLEN', Decimal('1600'), 0),
 ('TURNER', Decimal('1500'), 0),
 ('JAMES', Decimal('950'), 0),
 ('WARD', Decimal('1250'), 0),
 ('FORD', Decimal('3000'), 300),
 ('SMITH', Decimal('800'), 0),
 ('SCOTT', Decimal('3000'), 300),
 ('ADAMS', Decimal('1100'), 0),
 ('MILLER', Decimal('1300'), 0)]

In [ ]:
%%sql

Alter table emp12
Modify ename varchar2(30)

insert into emp12(ename, age, gender,major,telecom,email,address)
values('남궁솔미', 27, '여','금융학과', 'Kt', 'jowajowa@yahoo.com', '경기도 군포시 쌍문동')

문제 108. 우리반 테이블에서 이름을 출력하고 그 옆에 보너스를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;이름의 철자가 3글자이면 보너스를 7000을 출력하고   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;이름의 철자가 2글자이면 보너스를 5000을 출력하고  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;이름의 철자가 4글자이면 보너스를 4000을 출력하시오

In [72]:
%%sql

select replace(ename, substr(ename, 2, 1), '*') "이름",
       case when length(ename) =3 then 7000
            when length(ename) =2 then 5000
            when length(ename) =4 then 4000 end as 보너스
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('남*솔미', 4000),
 ('이*혁', 7000),
 ('한*', 5000),
 ('현*연', 7000),
 ('성*창', 7000),
 ('유*영', 7000),
 ('김*민', 7000),
 ('이*원', 7000),
 ('김*원', 7000),
 ('김*승', 7000),
 ('김*린', 7000),
 ('신*종', 7000),
 ('구*모', 7000),
 ('김*순', 7000),
 ('허*민', 7000),
 ('이*성', 7000),
 ('황*현', 7000),
 ('장*진', 7000),
 ('권*환', 7000),
 ('송*미', 7000),
 ('정*원', 7000),
 ('김*비', 7000),
 ('김*라', 7000),
 ('권*원', 7000),
 ('정*희', 7000),
 ('허*', 5000),
 ('양*준', 7000),
 ('김*원', 7000)]

문제 110. 우리반 테이블의 이름의 철자의 갯수와 관계없이 
             일괄적으로 이름이 *이 아래와 같이 출력되게 하시오

In [76]:
%%sql

select replace( ename, case when length(ename) =3 then substr(ename, 2, 1) 
                            when length(ename) =4 then substr(ename, -2, 1) end, '*' ) "이름"
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('남궁*미',),
 ('이*혁',),
 ('한결',),
 ('현*연',),
 ('성*창',),
 ('유*영',),
 ('김*민',),
 ('이*원',),
 ('김*원',),
 ('김*승',),
 ('김*린',),
 ('신*종',),
 ('구*모',),
 ('김*순',),
 ('허*민',),
 ('이*성',),
 ('황*현',),
 ('장*진',),
 ('권*환',),
 ('송*미',),
 ('정*원',),
 ('김*비',),
 ('김*라',),
 ('권*원',),
 ('정*희',),
 ('허혁',),
 ('양*준',),
 ('김*원',)]

문제 111. emp 테이블에서 이름을 출력하고 입사한 요일을 출력하는데
              입사한 요일이 월화수목금토일 순으로 출력하시오

In [85]:
%%sql

select ename, to_char(hiredate, 'DAY')
    from emp
    order by to_char(hiredate-1, 'D') asc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('WARD', '월요일'),
 ('MILLER', '월요일'),
 ('KING', '화요일'),
 ('SMITH', '화요일'),
 ('SCOTT', '수요일'),
 ('JONES', '수요일'),
 ('ALLEN', '수요일'),
 ('MARTIN', '목요일'),
 ('FORD', '금요일'),
 ('JAMES', '금요일'),
 ('BLAKE', '금요일'),
 ('TURNER', '금요일'),
 ('ADAMS', '토요일'),
 ('CLARK', '토요일'),
 ('JACK', '일요일')]